# Тесты для лабораторной
## Входные данные
my_snprintf(buffer, buf_size, "formats", arg1)
## Выходные данные
- in_01 -- позитивный -- спецификатор d
- in_02 -- позитивный -- спецификатор c
- in_03 -- позитивный -- спецификатор s
- in_04 -- позитивный -- спецификатор llx
- in_05 -- позитивный -- спецификатор hx
- in_06 -- позитивный -- спецификатор hd

